src/mp_toir/Documents/мп_РегистрацияПроверокОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>мп_РегистрацияПроверокОборудования</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_ИсточникиДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Проверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УзелОбъектаЭксплуатации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мп_ВидыПроверокОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Enums/мп_СтатусыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_СтатусыОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВМП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Documents/мп_РегистрацияПроверокОборудования/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ПометкаУдаления Тогда
		Если ОбщегоНазначенияСервер.ЗапретПометкиУдаленияДокументовТОиР(СтатусОбмена) Тогда
			Отказ = Истина;
			СтатусДокумента = Перечисления.мп_СтатусыОбмена.СтатусПредставленияДокумента(СтатусОбмена);
			ОбщегоНазначения.СообщитьПользователю(СтатусДокумента + ": нельзя помечать на удаление", , , Отказ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если Не ЭтотОбъект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.КВыгрузкевКИС Тогда
		
		Возврат;
		
	КонецЕсли;

	УзелЦентральнойБазы = ОбщегоНазначенияПовтИсп.ПолучитьУзелЦентральнойБазы();
	ПланыОбмена.ЗарегистрироватьИзменения(УзелЦентральнойБазы, ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;
	
	Если ОбщегоНазначенияСервер.ЗапретПометкиУдаленияДокументовТОиР(СтатусОбмена) Тогда
		
		Отказ = Истина;
		СтатусДокумента = Перечисления.мп_СтатусыОбмена.СтатусПредставленияДокумента(СтатусОбмена);
		ОбщегоНазначения.СообщитьПользователю(СтатусДокумента + ": нельзя отменять проведение", , , Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе

	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	
#КонецЕсли
